# UniqueID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SteelElementProperties..::..UniqueID Property
SteelElementProperties Class See Also
---
This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Guid UniqueID { get; internal set; }
```

Visual Basic
---
```text
Public Property UniqueID As Guid
	Get
	Friend Set
```

Visual C++
---
```text
public:
property Guid UniqueID {
	Guid get ();
	internal: void set (Guid value);
}
```

# Remarks
This id should not be confused with the guid returned by ExportUtils.GetExportId().
# See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace